#+title: it/infosec💻
#+begin_quote
"Memory forensics is arguably the most fruitful, interesting, and provocative realm of digital forensics. Each function performed by an operating system or applica- tion results in specific modifications to the computer’s memory (RAM), which can often persist a long time after the action, essentially preserving them. Additionally, memory forensics provides unprecedented visibility into the runtime state of the system, such as which processes were running, open network connections, and recently executed com- mands. You can extract these artifacts in a manner that is completely independent of the system you are investigating, reducing the chance that malware or rootkits can interfere with your results. Critical data often exists exclusively in memory, such as disk encryp- tion keys, memory-resident injected code fragments, off-the-record chat messages, unen-crypted e‑mail messages, and non-cacheable Internet history records."
The art of memory forensics
Introduction.
#+end_quote
*** Route traffic through tor network
Identify you network interfaces.
#+begin_src bash :results drawer replace
ip l
#+end_src

#+RESULTS:
:results:
1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN mode DEFAULT group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
2: enp3s0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP mode DEFAULT group default qlen 1000
    link/ether 2c:fd:a1:bb:d8:dd brd ff:ff:ff:ff:ff:ff
3: docker0: <NO-CARRIER,BROADCAST,MULTICAST,UP> mtu 1500 qdisc noqueue state DOWN mode DEFAULT group default
    link/ether 02:42:7c:f8:63:c6 brd ff:ff:ff:ff:ff:ff
:end:
*Routing traffic through tor network using iptables*
[[https://www.linuxquestions.org/questions/linux-security-4/iptables-routing-all-traffic-through-tor-hidden-service-on-a-raspberry-pi-4175599577/][Example 1]]
